## Plan for tf_roles
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 5 to add, 0 to change, 3 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role_policy_attachment.admin must be replaced
-/+ resource "aws_iam_role_policy_attachment" "admin" {
      ~ id         = "gh_plan_role-20220110194853723400000001" -> (known after apply)
      ~ role       = "gh_plan_role" -> "gh_admin_role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.readonly will be created
  + resource "aws_iam_role_policy_attachment" "readonly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + role       = "gh_plan_role"
    }

  # module.apply_role.aws_iam_openid_connect_provider.github will be destroyed
  - resource "aws_iam_openid_connect_provider" "github" {
      - arn             = "arn:aws:iam::507252742351:oidc-provider/token.actions.githubusercontent.com" -> null
      - client_id_list  = [
          - "sts.amazonaws.com",
        ] -> null
      - id              = "arn:aws:iam::507252742351:oidc-provider/token.actions.githubusercontent.com" -> null
      - tags            = {
          - "CostCentre" = "scan-websites-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all        = {
          - "CostCentre" = "scan-websites-production"
          - "Terraform"  = "true"
        } -> null
      - thumbprint_list = [
          - "a031c46782e6e6c662c2c87c76da9aa62ccabd8e",
        ] -> null
      - url             = "token.actions.githubusercontent.com" -> null
    }

  # module.apply_role.aws_iam_role.this will be destroyed
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::507252742351:role/gh_plan_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - ForAnyValue:StringLike = {
                              - token.actions.githubusercontent.com:sub = "repo:cds-snc/scan-websites:ref:refs/heads/main"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::507252742351:oidc-provider/token.actions.githubusercontent.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-01-10T19:48:52Z" -> null
      - force_detach_policies = false -> null
      - id                    = "gh_plan_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AdministratorAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "gh_plan_role" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "CostCentre" = "scan-websites-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all              = {
          - "CostCentre" = "scan-websites-production"
          - "Terraform"  = "true"
        } -> null
      - unique_id             = "AROAXMGU6TDHRTFFJ37RH" -> null

      - inline_policy {}
    }

  # module.gh_oidc_roles.aws_iam_openid_connect_provider.github will be created
  + resource "aws_iam_openid_connect_provider" "github" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + tags_all        = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + thumbprint_list = [
          + "a031c46782e6e6c662c2c87c76da9aa62ccabd8e",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # module.gh_oidc_roles.aws_iam_role.this["gh_admin_role"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gh_admin_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.gh_oidc_roles.aws_iam_role.this["gh_plan_role"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gh_plan_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

9 tests, 9 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
